Attribute VB_Name = "Keywords"
Option Explicit
Rem 任何關鍵字檢索、標識相關之屬性、參照記錄

Property Get 易學KeywordsToMark() As Variant
    易學KeywordsToMark = Array("易", "周易", "易經", _
        "卦", "節卦", "離卦", _
        "爻", _
        "系辭", "繫辭", "擊辭", "擊詞", "繫詞", "說卦", "序卦", _
            "卦序", "敘卦", "雜卦", "文言", "乾坤", "元亨", "利貞", "史記", _
        "筮", "夬", "〈乾〉", "〈坤〉", "乾、坤", "〈乾、坤〉", "噬嗑", "賁", ChrW(20089), "既濟", ChrW(26083) & "濟", "未濟", "十翼", _
        "大" & ChrW(22766), _
        "九五", "六二", "上九", "上六", "九二", "九三", "六四", "初六", "六三", "用九", _
        "河圖", "洛書", "太極", "無極", _
            "象曰", "〈象〉曰", "象日", "象云", "象傳", "彖", _
            "艮", "頤", "坎", "中孚", "兌", "蠱", "姤", "巽", "剝", "遯", "大壯", "明夷", "小畜", "大畜", "睽", "暌", "歸妹", "小過", "大有", "大過", "〈泰〉", "〈否〉", "〈損〉", "〈益〉", "〈屯〉", "〈豫〉", "〈旡妄〉", "〈復〉", "〈震〉", _
            "老陰", "老陽", "少陰", "少陽", "繇辭", "繇詞", _
            "咎", "咸恒", "咸恆", _
        ChrW(26080) & ChrW(-10171) & ChrW(-8522), _
        "無咎", ChrW(26080) & "咎", "天咎", _
        "隨時之義", "庖有魚", "包有魚")
        
End Property

