Attribute VB_Name = "Keywords"
Option Explicit
Rem 任何關鍵字檢索、標識相關之屬性、參照記錄

Property Get 易學KeywordsToMark() As Variant
    易學KeywordsToMark = Array("易", "周易", "易經", "五經", "七經", "十三經", _
        "卦", "節卦", "離卦", _
        "爻", _
        "系辭", "繫辭", "擊辭", "擊詞", "繫詞", "說卦", "序卦", _
            "卦序", "敘卦", "雜卦", "文言", "乾坤", "元亨", "利貞", "史記", _
        "筮", "夬", "〈乾〉", "〈坤〉", "乾、坤", "〈乾、坤〉", "噬嗑", "賁", ChrW(20089), "既濟", ChrW(26083) & "濟", "未濟", "十翼", _
        "大" & ChrW(22766), _
        "初九", "九二", "九三", "九四", "九五", "上九", ChrW(19972) & "九", "用九", "初六", "六二", "六三", "六四", "六五", "上六", "用六", _
        "河圖", "洛書", "太極", "無極", _
            "象曰", "〈象〉曰", "象日", "象云", "象傳", "〈大象〉", "小象", "象義", "彖", _
            "艮", "頤", "坎", "中孚", "兌", "蠱", "姤", "巽", "剝", "遯", "大壯", "明夷", "明" & ChrW(-10171) & ChrW(-8739), "小畜", "大畜", "萃", "蹇", "渙", ChrW(28067), "睽", "暌", "歸妹", "小過", "大有", "大過", "〈泰〉", "〈否〉", "〈損〉", "〈益〉", "〈屯〉", "〈豫〉", "〈旡妄〉", "〈復〉", "〈震〉", _
            "老陰", "老陽", "少陰", "少陽", "繇辭", "繇詞", _
            "咎", "咸恒", "咸恆", _
        "無妄", ChrW(26080) & ChrW(-10171) & ChrW(-8522), ChrW(26080) & "妄", _
        "無咎", ChrW(26080) & "咎", "天咎", _
        "隨時之義", "庖有魚", "包有魚", "精義入神", "豶豕", "童牛", "承之羞", "雷在天上", "錫馬", "蕃庶", "晝日", "三接", "懲忿", "窒欲", "懲窒", "敬以直內", "義以方外", "迷後得主", "利西南", "品物咸章", "天下大行", "益動而", "日進無疆", "日進" & ChrW(26080) & "疆", "頻巽", "頻" & ChrW(14514), "豚魚", "頻復", "閑邪", "存誠", "乾乾", "悔吝", "憧憧", "類萬物", "柔順利貞", ChrW(-10163) & ChrW(-9167) & "順利貞", "比之匪人", "履貞", "貞厲", "履道坦坦", "貞吉", _
        "悔亡", "悔" & ChrW(20158), "悔" & ChrW(20838), "時義", "健順")
        
End Property

